Documents/ЗаявкаНаРасходПоСотруднику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>ЗаявкаНаРасходПоСотруднику</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БюджетПоМесяцам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РКО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяСметы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиСметы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗадачаПроекта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗадачиПроектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ЗадачиПроектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ЗадачиПроектов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Проекты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроектМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостановкаЗадачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоИсполнители</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТиповаяЗадача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТиповыеЗадачиПроектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоРабот</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеРабот</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланироватьОтКонца</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбеспеченоПрошлымиПериодами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодЗадачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановоеЮЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникФинансирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникФинансирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Исполнители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяСтавка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТарифныеСтавки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЭтапыГрафикаОплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаПлатежа</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Фиксировано</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Гарантировано</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ЗаявкаНаРасходПоСотруднику/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция  ПолучитРазмерРКО( РКО, НаДату   )
	// из регистра	
	Если РКО Тогда
		ПроцентРКО = ПлановыйПоказательСметы( Год( НаДату ), "СтавкаРКО" );
		Возврат ПроцентРКО /100;
	КонецЕсли;
	Возврат 0;
КонецФункции

&НаКлиенте
Процедура ПересчетСуммыДокумента()
	Объект.СуммаДокумента = Окр( Объект.Расходы.Итог("Сумма") * (1 + ПолучитРазмерРКО(Объект.РКО, Объект.ПериодРегистрации )), 2 );
КонецПроцедуры

&НаКлиенте
Процедура РасходыПриИзменении(Элемент)
	ПересчетСуммыДокумента();
КонецПроцедуры

&НаКлиенте
Процедура РКОПриИзменении(Элемент)
	ПересчетСуммыДокумента();
КонецПроцедуры


&НаСервереБезКонтекста
Функция  ПодразделениеФизЛица(ФизическоеЛицо, Дата)
	тз = УП_КадрыСервер.СотрудникиФизЛица( ФизическоеЛицо, НачалоМесяца( Дата ));
	Если тз.Количество() = 0 Тогда
		Возврат Неопределено
	Иначе
		Возврат тз[0].Подразделение;
	КонецЕсли;
КонецФункции


&НаКлиенте
Процедура ФизическоеЛицоПриИзменении(Элемент)
	Объект.Подразделение = ПодразделениеФизЛица( Объект.ФизическоеЛицо, Объект.ПериодРегистрации );
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииПриИзменении(Элемент)
	Объект.ПериодРегистрации = НачалоМесяца( Объект.ПериодРегистрации );
КонецПроцедуры

&НаКлиенте
Процедура РасходыЗадачаПроектаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//
	ПараметрыПР = Новый Структура;
	Если ЗадачиВсехПодразделений Тогда
		ПараметрыПР.Вставить("Подразделение", ПредопределенноеЗначение("Справочник.Подразделения.ПустаяСсылка" ));
	Иначе
		ПараметрыПР.Вставить("Подразделение", Объект.Подразделение );
	КонецЕсли;
	ПараметрыПР.Вставить("РежимВыбора", 	Истина);
	
	
	ОткрытьФорму( "Справочник.ЗадачиПроектов.Форма.ФормаВыбораПоПодразделению", ПараметрыПР, Элемент );
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#Область ЗагрузкаИзФайла

//************************
//  Excel
&НаКлиенте
Процедура ФайлЗагрузкиExcelНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла( РежимДиалогаВыбораФайла.Открытие );
	ДиалогОткрытияФайла.ПолноеИмяФайла 	= "";
	ДиалогОткрытияФайла.Фильтр			= "Лист Excel(*.xls)|*.xls|Лист Excel2007-...(*.xlsx)|*.xlsx";
	ДиалогОткрытияФайла.ПолноеИмяФайла	= ФайлЗагрузкиExcel;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = НСтр("ru = 'Укажите файл для загрузки'");
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		ФайлЗагрузкиExcel = ДиалогОткрытияФайла.ПолноеИмяФайла;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
		Если ПустаяСтрока(ФайлЗагрузкиExcel) Тогда
		ПоказатьПредупреждение(,"Укажите файл Microsoft Excel.", 10);
		Возврат;
	КонецЕсли;
	Если Объект.Расходы.Количество() <> 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ОбработкаФайлаПоВопросу", ЭтаФорма);
		ПоказатьВопрос( Оповещение, "При загрузке документ будет очищен, продолжить?", РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
		
	ОбработкаФайла();
	// Вставить содержимое обработчика.

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаФайлаПоВопросу( Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОбработкаФайла();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаФайла() 
	ТаблицаЗагрузки = Новый ТабличныйДокумент;
	
	Попытка
		// Загрузка Microsoft Excel
		//Сообщить("Загрузка Microsoft Excel...");
		ExcelПриложение = Новый COMОбъект("Excel.Application");
		
	Исключение
		
		Сообщить("Ошибка при загрузке Microsoft Excel." + Символы.ПС + ОписаниеОшибки(), СтатусСообщения.Внимание);
		Возврат;
		
	КонецПопытки;
		
	Попытка
		
		// Открытие файла Microsoft Excel
		//Состояние("Открытие файла Microsoft Excel...");
		ExcelФайл = ExcelПриложение.WorkBooks.Open(ФайлЗагрузкиExcel);
		
		// Обработка файла Microsoft Excel
		//Состояние("Обработка файла Microsoft Excel...");
		ExcelЛист = ExcelФайл.Sheets(1);
		xlCellTypeLastCell = 11;
		ExcelПоследняяСтрока = ExcelЛист.Cells.SpecialCells(xlCellTypeLastCell).Row;
		ExcelПоследняяКолонка = ExcelЛист.Cells.SpecialCells(xlCellTypeLastCell).Column;
		
		//ТаблицаЗагрузки.Очистить();
		
		Для Строка = 1 По ExcelПоследняяСтрока Цикл
			
			Для Колонка = 1 По ExcelПоследняяКолонка Цикл
				
				//Состояние("Обработка файла Microsoft Excel : "
							//+ "строка " + Строка + " из " + ExcelПоследняяСтрока
							//+ ", колонка " + Колонка + " из " + ExcelПоследняяКолонка);
				ExcelЯчейка = ExcelЛист.Cells(Строка, Колонка);
				ТаблицаЗагрузки.Область(Строка, Колонка, Строка, Колонка).Текст = ExcelЯчейка.Value;
				
			КонецЦикла;
			
		КонецЦикла;
		
	Исключение
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка при открытии/чтении файла " + ФайлЗагрузкиExcel + "." + Символы.ПС + ОписаниеОшибки();
		Сообщение.Сообщить();
		
	КонецПопытки;
			
	ExcelПриложение.Quit();
	
	ОтбработатьТаблицуЗагрузки( ТаблицаЗагрузки );
	//
	Объект.РКО	= Истина;
	ФизическоеЛицоПриИзменении("");
	ПересчетСуммыДокумента();
	
	
КонецПроцедуры // ОбработкаФайла(Элемент)


&НаСервере
Процедура ОтбработатьТаблицуЗагрузки( ТаблицаЗагрузки )
	
	//ТаблицаЗагрузки = Новый ТабличныйДокумент;
	ФИО = ТаблицаЗагрузки.Область(1,1).Текст;
	// тест
	//ФИО = "Дубровина Е.В.";
	Если НЕ ЗначениеЗаполнено( ФИО ) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не указан сотрудник!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	//
	Документ 				= РеквизитФормыВЗначение("Объект");
	ФизическоеЛицо			= Справочники.ФизическиеЛица.НайтиПоКоду( ФИО, Истина );
	Если Документ.ФизическоеЛицо <> ФизическоеЛицо Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Файл загрузки для другого физического лица ["+ФИО+"]";
		Сообщение.Сообщить();
		
		Возврат;
	КонецЕсли;
	//	
	Документ.Расходы.Очистить();
	
	СтатьяРасходов = Константы.СтатьяРасходовПоСотруднику.Получить();
	
	МаксимальнаяДата = Дата(1,1,1);
	// для 
	СдвигНачалаЗаДень 	= 0;
	ПредыдущаяДата 		= "";
	Для Н = 3 ПО ТаблицаЗагрузки.ВысотаТаблицы Цикл
		// т.к. из табеля, то не во всех строках будет сумма
		Сумма			= ТаблицаЗагрузки.Область(Н,6).Текст;
		Если НЕ ЗначениеЗаполнено( Сумма ) Тогда
			Продолжить;
		КонецЕсли;
		
		// дата 
		Дата = ДатаИзФайлаExcel( ТаблицаЗагрузки.Область(Н,1).Текст);
		Если Дата = Неопределено Тогда Прервать; КонецЕсли;
		МаксимальнаяДата  = Макс( МаксимальнаяДата , Дата);
		
		СтрДок					= Документ.Расходы.Добавить();
		СтрДок.Дата				= Дата;
		
		// представление проекта = план работ
		сПланРабот				= ПланРаботИзФайлаExcel( ТаблицаЗагрузки.Область(Н,4).Текст, Дата );
		СтрДок.ЗадачаПроекта 	= сПланРабот.Основание.ЗадачаПроекта;
		// 
		СтрДок.СтатьяРасходов	= СтатьяРасходов;
		СтрДок.Сумма			= Сумма;
		СтрДок.Комментарий		= ТаблицаЗагрузки.Область(Н,7).Текст;
		
	КонецЦикла;
	Документ.Расходы.Сортировать("Дата,ЗадачаПроекта");
	
	//Документ.Дата = МаксимальнаяДата;
	Документ.ПериодРегистрации = НачалоМесяца( МаксимальнаяДата );
	// закрываем
	ЗначениеВРеквизитФормы(Документ, "Объект");
	// меняем подразделение	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДатаИзФайлаExcel( ДатаТекст)
	Попытка
		День 	= Число(Лев(ДатаТекст,2));
		Месяц 	= Число(Сред(ДатаТекст,4,2));	 
		Год 	= Число(Сред(ДатаТекст,7,4));	 
		Возврат Дата( Год, Месяц, День );
	Исключение
		Возврат Неопределено;
	КонецПопытки;
КонецФункции

&НаСервереБезКонтекста
Функция ПланРаботИзФайлаExcel( Знач НомерПланаРабот, Дата )
	Возврат УП_ПланыРаботПоПроектам.ПланРаботИзФайлаExcel( НомерПланаРабот, Дата );
КонецФункции

//&НаСервереБезКонтекста
//Функция СтатьяРасходовПоУмолчанию()
//	Возврат Справочники.СтатьиРасходов.НайтиПоНаименованию("Командировочные расходы");
//КонецФункции

#КонецОбласти
